# #create
# a = 'hello' # одинарные ковычки
# b = "hello" # двойные ковычки
# c = "я 'знаю' phyton" # комбинированные ковычки
# d = 'я "знаю" phyton' # комбинированные ковычки
# e = "я 'знаю" phyton' # нельзя
# a = 'привет'
# print(a)
# print('иван')
# a = [0] # 'п'
# a = [1] # 'р'
# a = [2] # 'и'
# a = [3] # 'в'
# a = [4] # 'е'
# a = [5] # 'т'
# a = [6] # ошибка, вышли за границы
# a = [-1] # 'т'
# a = [-2] # 'е'
# a = [-3] # 'в'
# a = [-4] # 'и'
# a = [-5] # 'р'
# a = [-6] # 'п'
# a = [-7] # ошибка, вышли за границы
#


a = 1, 2, 3
b = str(a)
print(b)
print(type(b))


a = int(input('введите целое число:-'))
if a %2 = = 0:
    print(f'число {a} является чётным')
else:
    print(f'число {a} является нечётным')
